cleanli2/stm32f407ve/Core/Src/cmd.c
#include "cmd.h"
#include "lprintf.h"
#include <stdint.h>
#include <string.h>
#include "stm32f4xx_hal.h"
#include "fatfs.h"
#include "lcd_nt35510.h"
#include "common.h"

#define uint uint32_t
#define lprint lprintf

#define BBN 5
#define MIN_YUV_FILES_NUM NPERBB*BBN
#define NPERBB 10000
#define GET_FILE_PATH_AND_NAME(buf, n) \
        slprintf(buf, "BB%d/V%d/YUV%d.BIN", n/NPERBB, (n%NPERBB)/100, n%NPERBB);

extern int g_fmounted;
static char cmd_buf[COM_MAX_LEN] = "";
static uint cmd_buf_p = COM_MAX_LEN;
static uint quit_cmd = 0;
extern uint32_t task_mask;
extern uint32_t logv;

char * str_to_hex(char *s, uint32_t * result);
void delay(int a);
uint get_howmany_para(char *s);
char * str_to_str(char *s, char**result);
uint32_t ci=0;
volatile uint32_t ghn=0;
volatile uint32_t gfn=0;
uint32_t dmabsz;
uint32_t fps;
uint32_t g_timetk=0;
uint32_t g_frame_w=640;
uint32_t g_frame_h=480;
uint32_t hnl=0;
uint32_t fnl=0;
uint32_t swap=0;

uint8_t cmd_caches[CMD_CACHES_SIZE][COM_MAX_LEN] = {0};
uint32_t cmdcache_index=0;
uint32_t review_cmd_his_index;
uint8_t read_buf[512*16];

extern const uint8_t ziku12[];
extern const uint8_t ziku[];
uint32_t get_ziku12_size();
uint32_t get_ziku_size();
void write_mem16(char *p);
void read_mem16(char *p);
void lcd_clr_window(u16 color, u16 xs, u16 ys, u16 xe, u16 ye);

char* lstrncpy(char*d, const char*s, unsigned int n)
{
    char*ret=d;
    while(n--){
        *d++=*s;
        if(*s++==0)return ret;
    }
    return ret;
}

int lstrcmp(const char *a,const char *b)
{
    while(1){
        if(*a!=*b++)return 1;
        if(*a++==0)return 0;
    }
}
void lmemset(char *d,unsigned char v,unsigned int n)
{
	while(n--)*d++=v;
}
char *lstrchr(const char *str, int c)
{
    while(1){
        if(*str==(char)c)return (char*)str;
        if(*str++==0)return NULL;
    }
}

void cmd_exit(char *p)
{
    (void)p;
    lprintf("Quit CMD!\r\n");
    quit_cmd = 1;

    return;

}
void reboot(char *p)
{
    (void)p;
    NVIC_SystemReset();

    return;

}

void history(char *p)
{
    (void)p;
    uint32_t n = CMD_CACHES_SIZE, cix = cmdcache_index;
    lprintf("\r\n");
    while(n--){
        if(cix==0){
            cix = CMD_CACHES_SIZE-1;
        }
        else{
            cix--;
        }
        if(cmd_caches[cix][0]!=0){
            lprintf("%s\r\n", cmd_caches[cix]);
        }
    }
    lprintf("\r\n");

    return;
}

void start_dma_uart_recv();
int dma_uart_recved();
void show_sdinfo();
void sd_read(uint8_t*read_buf, uint p1, uint p2);
//extern char*duf;
extern char duf[];
extern SD_HandleTypeDef hsd;
extern I2C_HandleTypeDef hi2c2;
void fs_test(const char*text);
void test(char*p)
{
    (void)p;
    uint para = 0, np;

    np = get_howmany_para(p);
    prt_dec(np);
    if(np > 0){
        p=str_to_hex(p, &para);
    }
    prt_hex(para);
    if(para==0){
        lprintf("gpio switch test\r\n");
        while(1){
            GPIOC->BSRR = GPIO_PIN_6;
            GPIOC->BSRR = (uint32_t)GPIO_PIN_6<< 16U;
        }
    }
    else if(para==1){
        lprintf("uart dma rcv test\r\n");
        prt_hex(duf);
        lmemset(duf, 0, 20);
        mem_print(duf, (uint32_t)duf, 20);
        start_dma_uart_recv();
        while(1){
            if(dma_uart_recved()){
                lprintf("recved!\r\n");
                mem_print(duf, (uint32_t)duf, 20);
            }
        }
    }
    else if(para==2){
        lprintf("sd card info\r\n");
        show_sdinfo();
    }
    else if(para==3){
        uint p1=0, p2=1;
        lprintf("sd card read\r\n");
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        if(np >= 3){
            p=str_to_hex(p, &p2);
        }
        prt_dec(p1);
        prt_dec(p2);
        sd_read(read_buf, p1, p2);
        mem_print((char*)read_buf, (uint32_t)0, 512);
    }
    else if(para==4){
        char*ps=0;
        lprintf("fs test\r\n");
        if(np >= 2){
            p=str_to_str(p, &ps);
        }
        prt_hex(ps);
        if(ps){
            lprintf("ps=%s\r\n", ps);
        }
        fs_test(ps);
    }
    else if(para==5){
        lprintf("i2c test\r\n");
        uint p1=0x20, p2=0x5a;
        uint8_t d;
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        if(np >= 3){
            p=str_to_hex(p, &p2);
        }
        d=p2;
        HAL_StatusTypeDef ret=HAL_I2C_Master_Transmit(&hi2c2, p1, &d, 1, 1000000);
        prt_hex(ret);
    }
    else if(para==7){
        lprintf("lcd clear test\r\n");
        uint p1=0xFFFF;
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        LCD_Clear(p1);
    }
    else if(para==8){
        lprintf("lcd set bak\r\n");
        uint p1=1000;
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        extern TIM_HandleTypeDef htim12;
        __HAL_TIM_SET_COMPARE(&htim12, TIM_CHANNEL_2, p1&0xffff);
    }
    else if(para==0x65){
        FRESULT res; /* FatFs function common result code */
        char fnm[32];
        FIL MyFile; /* File object for SD */
        if(!g_fmounted){
            logline;
            return;
        }
        uint p1=100;
        uint32_t bytesread; /* File write/read counts */
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }

        if(p1>MIN_YUV_FILES_NUM-1){
            p1-= MIN_YUV_FILES_NUM;
        }
        lprintf("one pic show %d with data dump\r\n", p1);
        GET_FILE_PATH_AND_NAME(fnm, p1);
        lprintf("fnm=%s\r\n", fnm);
        FILINFO myfno;
        if(f_stat(fnm, &myfno) == FR_OK){
            prt_dec(myfno.fsize);
        }
        if(f_open(&MyFile, fnm, FA_READ) == FR_OK){
            lprintf("open OK\r\n");
            LCD_SetWindows(0,0,639,479);   
            res = f_read(&MyFile, (u8*)0x20004000, 0x1b000, (UINT*)&bytesread);
            //prt_hex(bytesread);
            //prt_hex(res);

            if((bytesread == 0) || (res != FR_OK))
            {
                logline;
                return;
            }
            else
            {
                //mem_print((char*)read_buf, 0, sizeof(read_buf));
                rgb565_to_lcd((u8*)0x20004000, bytesread);
            }
            /*##-9- Close the open text file #############################*/
            f_close(&MyFile);
        }
        else{
            logline;
        }
    }
    else if(para==6){
        FRESULT res; /* FatFs function common result code */
        char fnm[32];
        FIL MyFile; /* File object for SD */
        if(!g_fmounted){
            logline;
            return;
        }
        uint p1=100;
        uint32_t bytesread; /* File write/read counts */
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }

        while(1){//-------------------------------------------------------------------------

        if(p1>MIN_YUV_FILES_NUM-1){
            p1-= MIN_YUV_FILES_NUM;
        }
        lprintf("pic show %d\r\n", p1);
        GET_FILE_PATH_AND_NAME(fnm, p1);
        lprintf("fnm=%s\r\n", fnm);
        prt_hex(sizeof(read_buf));
        FILINFO myfno;
        if(f_stat(fnm, &myfno) == FR_OK){
            prt_dec(myfno.fsize);
        }
        if(f_open(&MyFile, fnm, FA_READ) == FR_OK){
            lprintf("open OK\r\n");
            u32 pic_ms=HAL_GetTick();
            lcd_clr_window(WHITE, 0, 0, 5, 479);
            lcd_clr_window(BLACK, 6, 0, 10, 479);
            lcd_clr_window(WHITE, 635, 0, 639, 479);
            lcd_clr_window(BLACK, 631, 0, 634, 479);
            LCD_SetWindows(0,0,639,479);   
            while(!f_eof(&MyFile)){
              res = f_read(&MyFile, read_buf, sizeof(read_buf), (UINT*)&bytesread);
              //prt_hex(bytesread);
              //prt_hex(res);

